<?php

namespace Database\Seeders;

use App\Models\author;
use Illuminate\Database\Seeder;

class AuthorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $authors = [
            ['first_name'=>'غابرييل','last_name'=>'ماركيز','bio'=>'روائي وصحفي وناشر وناشط سياسي كولمبي ولد في أراكاتاكا، ماغدالينا في كولومبيا نال جائزة نوبل للأدب 1982 وهو واحد من أشهر كتاب الوقائعية العجائبية.','photo'=>'غابرييل ماركيز.jpg','birth'=>'1927','death'=>'2014'],
            ['first_name'=>'ستيفن','last_name'=>'هوكينج','bio'=>'من أبرز علماء الفيزياء النظرية وعلم الكون على مستوى العالم، درس في جامعة أكسفورد وحصل منها على درجة الشرف الأولى في الفيزياء، أكمل دراسته في جامعة كامبريدج للحصول على الدكتوراه في علم الكون، له أبحاث نظرية في علم الكون وأبحاث في العلاقة بين الثقوب السوداء والديناميكا الحرارية، كما له أبحاث ودراسات في التسلسل الزمني.','photo'=>'ستيفن هوكينج.jpg','birth'=>'1942','death'=>'2018'],
            ['first_name'=>'سليم','last_name'=>'قبعين','bio'=>'مدرّس وصحفي وكاتب ومؤرخ ومترجم فلسطيني، يُعد واحداً من أهم الشخصيات الأدبية الفلسطينية والعربية خاصةً في مجال الترجمة، وهو من أوائل المترجمين العرب الذين عرّفوا القارئ العربي بالأدب الروسي، حيث كان يُلقب بـ عميدُ المترجِمينَ عن الروسيةِ','photo'=>'سليم قبعين.png','birth'=>'1870','death'=>'1951'],
            ['first_name'=>'نظام','last_name'=>'بركات','bio'=>'أستاذ في العلوم السياسية ودكتور في جامعة اليرموك.','photo'=>'نظام بركات.jpg','birth'=>'1951','death'=>null],
            ['first_name'=>'عثمان','last_name'=>'الرواف','bio'=>'دكتور في العلوم السياسية وعضو في مجلس الشورى.','photo'=>null,'birth'=>'1947','death'=>null],
            ['first_name'=>'محمد','last_name'=>'الحلوة','bio'=>'مستشار في الديوان الملكي في المملكة العربية السعودية.','photo'=>null,'birth'=>'1949','death'=>null],
            ['first_name'=>'ألف','last_name'=>'شفق','bio'=>' هي روائية تركية تكتب باللغتين التركية والإنجليزية، وقد ترجمت أعمالها إلى ما يزيد على ثلاثين لغة.','photo'=>'الف شفق.jpg','birth'=>'1971','death'=>null],
            ['first_name'=>'حسن','last_name'=>'الجندي','bio'=>'كاتب وروائي مصري شاب اقترن اسمه بعالم الجن والعفاريت والمخطوطات القديمة والقتلة النفسيين وعالم الرعب. على شبكة الإنترنت تخطت نسبة مشاهدات مؤلفاته مائة ألف قارئ (100 ألف) حصل على شهرة ليست بالقليلة داخل مصر وخارجها من خلال ثلاثيته (مخطوطة بن إسحاق) والتي وضعت في البداية على المنتديات العربية وانتهت بطباعتها ونزولها المكتبات المصرية.','photo'=>'حسن الجندي.png','birth'=>'1993','death'=>null],
            ['first_name'=>'أحمد','last_name'=>'زويل','bio'=>'هو عالم كيميائي مصري أمريكي حاصل على جائزة نوبل في الكيمياء لسنة 1999 لأبحاثه في مجال كيمياء الفيمتو، حيث قام باختراع ميكروسكوب يقوم بتصوير أشعة الليزر في زمن مقداره فمتوثانية، وهكذا يمكن رؤية الجزيئات أثناء التفاعلات الكيميائية، ويعتبر هو رائد علم كيمياء الفيمتو، ولقب بـ«أبو كيمياء الفيمتو»، وهو أستاذ الكيمياء وأستاذ الفيزياء في معهد كاليفورنيا للتقنية.','photo'=>'احمد زويل.jpg','birth'=>'1946','death'=>'2016'],
            ['first_name'=>'مصطفى','last_name'=>'محمود','bio'=>' فيلسوف وطبيب وكاتب مصري. ألف 89 كتاباً منها الكتب العلمية والدينية والفلسفية والاجتماعية والسياسية إضافة إلى الحكايات والمسرحيات وقصص الرحلات، ويتميز أسلوبه بالجاذبية مع العمق والبساطة.','photo'=>'مصطفى محمود.jpg','birth'=>'1921','death'=>'2009'],
            ['first_name'=>'رانية','last_name'=>'أمين','bio'=>'مؤلفة كتب اطفال ورسامة مصرية.','photo'=>'رانية أمين.jpg','birth'=>'1965','death'=>null],
            ['first_name'=>'أجاثا','last_name'=>'كريستي','bio'=>'أعظم مؤلفة روايات بوليسية في التاريخ حيث بيعت أكثر من مليار نسخة من رواياتها التي ترجمت لأكثر من 45 لغة.','photo'=>'اجاثا كريستي.jpg','birth'=>'1890','death'=>'1976'],
            ['first_name'=>'أنيس','last_name'=>'منصور','bio'=>' كاتب صحفي وفيلسوف وأديب مصري. اشتهر بالكتابة الفلسفية عبر ما ألّفه من إصدارت، جمع فيها إلى جانب الأسلوب الفلسفي الأسلوب الأدبي الحديث.','photo'=>'أنيس منصور.jpg','birth'=>'1924','death'=>'2011'],
            ['first_name'=>'أحمد خالد','last_name'=>'توفيق','bio'=>'طبيب، وكاتب، ومؤلف، ومترجم مصري. يُعد أول كاتب عربي في مجال أدب الرعب. والأشهر في مجال أدب الشباب، والفنتازيا، والخيال العلمي. لُقب بـ«العراب».','photo'=>'احمد خالد توفيق.jpeg','birth'=>'1962','death'=>'2018'],
            ['first_name'=>'دان','last_name'=>'براون','bio'=>' مؤلف أمريكي لقصص الخيال والإثارة الممزوجة بطابع علمي وفلسفي حديث بأسلوب مشوق مكّنه من تحقيق أفضل المبيعات. حققت رواياته رواجاً كبيراً بين الأجيال الشابة في أمريكا وأوروبا، أشهر رواياته رواية شيفرة دا فينشي The Da Vinci Code التي نشرت عام 2003، وتم تصويرها كفيلم سينمائي من بطولة توم هانكس.','photo'=>'دان براون.jpg','birth'=>'1964','death'=>null],
            ['first_name'=>'خليل محمد','last_name'=>'الشماع','bio'=>'دكتوراه بإدارة الأعمال، جامعة كاليفورنيا في بيركلي، الولايات المتحدة الأمريكية، 1962/ خريج متميز.','photo'=>'خليل الشماع.jpg','birth'=>'1963','death'=>null],
        ];

        author::insert($authors);
    }
}
