<?php

namespace Database\Seeders;

use App\Models\book;
use Illuminate\Database\Seeder;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $books = [
            ['name'=>'مئة عام من العزلة','description'=>'.تدور رواية مئة عام من العزلة حول مدينة خيالية في كولومبيا والعائلة التي أسستها، وعاشت فيها على مدى عدة أجيال','page_number'=>'504','publishing_house'=>'بوينس آيرس','publishing_year'=>'1967-1-1','copies_number'=>'50','price'=>'3000','cover'=>'مئة عام من العزلة.jpg','classification'=>'grade 10','state'=>'1','PDF'=>null],
            ['name'=>'تاريخ موجز للزمن','description'=>'كتاب تاريخ موجز للزمان هو بمثابة رحلة لملاح بارع يجوب آفاقا عجيبة في علم التكوين والفيزياء، مستنداً إلى موهبة علمية فذة وسعة أفق خلاقة بحثاً عن الطريق إلى نظرية علمية كبرى توحد سائر النظريات.','page_number'=>'163','publishing_house'=>'دار التنوير','publishing_year'=>'2001-1-1','copies_number'=>'45','price'=>'1500','cover'=>'تاريخ موجز للزمن.jpg','classification'=>'grade 10','state'=>'1','PDF'=>null],
            ['name'=>'قصص روسية','description'=>'مجموعة من القصص الروسية الممتعة، والتي لم تقتصر أهدافها على التسلية فقط بل تعدتها؛ ليبث فيها معارف كثيرة.','page_number'=>'95','publishing_house'=>'مؤسسة هنداوي','publishing_year'=>'2014-2-3','copies_number'=>'70','price'=>'1250','cover'=>'قصص روسية.png','classification'=>null,'state'=>'0','PDF'=>'قصص روسية.pdf'],
            ['name'=>'مبادئ علم السياسة','description'=>'المفهوم الإصطلاحي لعلم السياسة: هناك عدة تعريفات لعلم السياسة منها: إنه علم دراسة الحكومات والمؤسسات والسلوك والممارسة السياسيين، بمعني أن علم السياسة يهتم بدراسة عملية الحكم والمؤسسات السياسية بنوعيها من مؤسسات رسمية (المؤسستان التشريعية والتنفيذية) وتنظيمات غير رسمية مثل الأحزاب وجماعات الضغط والرأي العام، كما يعني بدراسة النشاطات السياسية للأفراد مثل عمليات التصويت في الإنتخابات وغيرها.','page_number'=>'408','publishing_house'=>'ذو النورين','publishing_year'=>'2014-4-26','copies_number'=>'20','price'=>'3500','cover'=>'مبادئ علم السياسة.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'قواعد العشق الأربعون','description'=>'في هذه الرواية تسرد الكاتبة حكايتين متوازيتين، إحداها في الزمن المعاصر والأخرى في القرن الثالث العشر، عندما واجه الرومي مرشده الروحي، الدرويش المتنقل المعروف بإسم «شمس التبريزي» وكيف أنهما معاً جسّدا رسالة شعر الحب الخالدة.','page_number'=>'500','publishing_house'=>'طوى للثقافة والنشر والإعلام','publishing_year'=>'2010-2-14','copies_number'=>'66','price'=>'4000','cover'=>'قواعد العشق الأربعون.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'ابتسم فأنت ميت','description'=>'لا يمكنك أن تجبر أحد على الابتسام.. إلا وهو ميت.','page_number'=>'271','publishing_house'=>'دارك للنشر والتوزيع','publishing_year'=>'2019-4-3','copies_number'=>'40','price'=>'2300','cover'=>'ابتسم فأنت ميت.png','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'عصر العلم','description'=>'هذا الكتاب هو محاولة لفهم طبيعة هذا العصر، من العلم إلى ما وراء العلم..من إيرادات سياسية وطاقات اجتماعية وثقافات للشعوب. وعليه..فأن هذا الكتاب يجمع بين تجربة المؤلف الذاتية فى عصر من العلم ورؤيته الشخصية للعالم فى عصر العلم','page_number'=>'280','publishing_house'=>'دار الشروق','publishing_year'=>'2017-1-1','copies_number'=>'24','price'=>'2200','cover'=>'عصر العلم.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'رحلتي من الشك إلى الإيمان','description'=>'يعرض الكتاب العديد من المواضيع والتساؤلات الفكرية والمتعلقة بخلق الإنسان، والجسد والعقل. ويتحدث الكتاب بشكل تفصيلي عن رحلة مصطفى محمود الطويلة من الشك وصولاً إلى الإيمان.','page_number'=>'127','publishing_house'=>'دار المعارف','publishing_year'=>'1970-1-1','copies_number'=>'89','price'=>'750','cover'=>'رحلتي من الشك إلى الإيمان.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'فاقد الحب يعطيه','description'=>'القصة المكونة من ثلاثة أجزاء تحكي قصص مؤثرة و صادقة من وجهة نظر كلب، و طفل وسیدة عجوز. وكیف ان رغم الظروف الصعبة یستطیع الإنسان اختیار مساعدة الآخرین و تقدیم المعونة و الحب لهم.','page_number'=>'108','publishing_house'=>'دار البلسم','publishing_year'=>'2015-3-3','copies_number'=>'92','price'=>'1000','cover'=>'فاقد الحب يعطيه.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'جثة فى المكتبة','description'=>'كانت السيدة بانتري مستغرقة في أحلام اليقظة كعادتها كلما نهضت من النوم صباحاً، حيث سمعت فجأة أصواتاً غير مألوفة في جوانب القصر الكبير، أصواتاً غامضة خافتة، ووقع أقدام سريعة، وهمهمة، وغمغمة، لا عهد لها بها، ثم طرقاً سريعاً على باب مخدعها، وصوت خادمتها تقول في فزع سيدتي، سيدتي، توجد جثة في غرفة المكتبة!!','page_number'=>'282','publishing_house'=>'دار عالم الثقافة للنشر والتوزيع','publishing_year'=>'2016-1-1','copies_number'=>'44','price'=>'2950','cover'=>'جثة في المكتبة.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'التاريخ انياب واظافر','description'=>'هذا نوع اخر من التاريخ، انه مجموعه عظام اى ان الحيوانات التى كانت تعيش من ملايين السنين قد ماتت فى ظروف لا نعرفها وتركت بقاياها. وجاء العلم الحديث فجعل العظام فحما. ثم درس الفحم وحلله وراح يعد ذراته ليعرف كم واحده من هذه الذرات قد ماتت وعن طريق الذرات الباقيه يعرف عمر هذه الحيوانات','page_number'=>'222','publishing_house'=>'دار الشروق','publishing_year'=>'2010-9-8','copies_number'=>'78','price'=>'2200','cover'=>'التاريخ انياب واظافر.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'في ممر الفئران','description'=>'عني أنتحِ بك جانبًا لأخبرك بسر لا يعرفه سوانا. احترس! لا ترفع صوتك.. عندما نحلم، فإن وعينا يسافر لبعد آخر ليمارس حياة أخرى ويلقى أناسًا آخرين، ويعرف وجوهًا أخرى. (فرويد) لم يقل هذا، لكن دعني أخبرك أنها الحقيقة. بل هي الحقيقة الوحيدة... وقال الله: (فليكن نور) فكان نور','page_number'=>'394','publishing_house'=>'دار الكرمة','publishing_year'=>'2016-4-7','copies_number'=>'21','price'=>'3200','cover'=>'في ممر الفئران.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'ملائكة وشياطين','description'=>'يتم استدعاء روبرت لانغدون، وهو بروفسور شهير متخرج من جامعة هارفارد في مجال دراسة الرموز وتحليلها، إلى أحد مراكز الأبحاث السويسرية بهدف تفسير رمز سري كان قد سفع على صدر أحد الفيزيائيين الذي وقع ضحية جريمة قتل شنيعة ومروعة. ولكن ما سوف يكتشفه هذا الخبير أمر لا يمكن للعقل تصوره:','page_number'=>'569','publishing_house'=>'دار المعارف','publishing_year'=>'2001-4-6','copies_number'=>'100','price'=>'5000','cover'=>'ملائكة وشياطين.jpg','classification'=>null,'state'=>'1','PDF'=>null],
            ['name'=>'مبادئ الإدارة مع التركيز على إدارة الأعمال','description'=>'','page_number'=>'432','publishing_house'=>'دار المسيرة','publishing_year'=>'2011-1-1','copies_number'=>'17','price'=>'4700','cover'=>'مبادئ الادارة مع التركيز على ادارة الاعمال.jpg','classification'=>null,'state'=>'0','PDF'=>null],
        ];

        book::insert($books);
    }
}
